"""
`Problem <https://leetcode-cn.com/problems/unique-paths/>`_
-------------------------------------------------------------

一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。

机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。

问总共有多少条不同的路径？

.. image:: ../../img/62.png

::

    示例 1：

    输入：m = 3, n = 7
    输出：28

    示例 2：

    输入：m = 3, n = 2
    输出：3
    解释：
    从左上角开始，总共有 3 条路径可以到达右下角。
    1. 向右 -> 向下 -> 向下
    2. 向下 -> 向下 -> 向右
    3. 向下 -> 向右 -> 向下

    示例 3：

    输入：m = 7, n = 3
    输出：28

    示例 3：

    输入：m = 3, n = 3
    输出：6

Tips
------

::

    递推公式:
    f(m, n) = f(m-1, n) + f(m, n-1)

+------------+------------+-----------+------------+------------+-----------+------------+-----------+
|            |  0         | 1         | 2          | 3          | 4         | 5          | 6         |
+============+============+===========+============+============+===========+============+===========+
| 0          |  1         | 1         | 1          | 1          | 1         | 1          | 1         |
+------------+------------+-----------+------------+------------+-----------+------------+-----------+
| 1          |  1         | 2         | 3          | 4          | 5         | 6          | 7         |
+------------+------------+-----------+------------+------------+-----------+------------+-----------+
| 2          |  1         | 3         | 6          | 10         | 15        | 21         | 28        |
+------------+------------+-----------+------------+------------+-----------+------------+-----------+


Answer
------

"""


class Solution:
    def uniquePaths(self, m: int, n: int) -> int:
        dp = [[1] * n for i in range(m)]
        for y in range(1, m):
            for x in range(1, n):
                dp[y][x] = dp[y][x - 1] + dp[y - 1][x]
        return dp[m-1][n-1]


import unittest


class TestSolution(unittest.TestCase):

    def setUp(self):
        self.test_case = [
            (1, 2, 1),
            (2, 1, 1),
            (3, 7, 28),
            (4, 7, 84),
        ]
        self.s = Solution()

    def test_solution(self):
        for m, n, answer in self.test_case:
            ans = self.s.uniquePaths(m, n)
            self.assertEqual(answer, ans)


if __name__ == '__main__':
    unittest.main()
